QX-C2000-DSP/f280049revb_evb_examples/libs/driverlib/inc/hw_epwm.h
#ifndef HW_EPWM_H
#define HW_EPWM_H

//*************************************************************************************************
//
// The following are defines for the EPWM register offsets
//
//*************************************************************************************************
#define EPWM_O_TBCTL         0x0U  // Time Base Control Register
#define EPWM_O_TBCTL2        0x2U  // Time Base Control Register 2
#define EPWM_O_EPWMSYNCINSEL 0x6U  // EPWM SYNCI Select Register
#define EPWM_O_TBCTR         0x8U  // Time Base Counter Register
#define EPWM_O_TBSTS         0xAU  // Time Base Status Register
#define EPWM_O_CMPCTL        0x10U // Counter Compare Control Register
#define EPWM_O_CMPCTL2       0x12U // Counter Compare Control Register 2
#define EPWM_O_DBCTL         0x18U // Dead-Band Generator Control Register
#define EPWM_O_DBCTL2        0x1AU // Dead-Band Generator Control Register 2
#define EPWM_O_AQCTL         0x20U // Action Qualifier Control Register
#define EPWM_O_AQTSRCSEL     0x22U // Action Qualifier Trigger Event Source Select Register
#define EPWM_O_PCCTL         0x28U // PWM Chopper Control Register
#define EPWM_O_VCAPCTL       0x30U // Valley Capture Control Register
#define EPWM_O_VCNTCFG       0x32U // Valley Counter Config Register
#define EPWM_O_HRCNFG        0x40U // HRPWM Configuration Register
#define EPWM_O_HRPWR         0x42U // HRPWM Power Register
#define EPWM_O_HRMSTEP       0x4CU // HRPWM MEP Step Register
#define EPWM_O_HRCNFG2       0x4EU // HRPWM Configuration 2 Register
#define EPWM_O_HRPCTL        0x5AU // High Resolution Period Control Register
#define EPWM_O_TRREM         0x5CU // HRPWM High Resolution Remainder Register
#define EPWM_O_GLDCTL        0x68U // Global PWM Load Control Register
#define EPWM_O_GLDCFG        0x6AU // Global PWM Load Config Register
#define EPWM_O_XLINK         0x70U // EPWMx Link Register
#define EPWM_O_AQCTLA        0x80U // Action Qualifier Control Register For Output A
#define EPWM_O_AQCTLA2       0x82U // Additional Action Qualifier Control Register For Output A
#define EPWM_O_AQCTLB        0x84U // Action Qualifier Control Register For Output B
#define EPWM_O_AQCTLB2       0x86U // Additional Action Qualifier Control Register For Output B
#define EPWM_O_AQSFRC        0x8EU // Action Qualifier Software Force Register
#define EPWM_O_AQCSFRC       0x92U // Action Qualifier Continuous S/W Force Register
#define EPWM_O_DBREDHR \
    0xA0U // Dead-Band Generator Rising Edge Delay High Resolution
          // Mirror Register
#define EPWM_O_DBRED \
    0xA2U // Dead-Band Generator Rising Edge Delay High Resolution
          // Mirror Register
#define EPWM_O_DBFEDHR \
    0xA4U                          // Dead-Band Generator Falling Edge Delay High Resolution
                                   // Register
#define EPWM_O_DBFED        0xA6U  // Dead-Band Generator Falling Edge Delay Count Register
#define EPWM_O_TBPHS        0xC0U  // Time Base Phase High
#define EPWM_O_TBPRDHR      0xC4U  // Time Base Period High Resolution Register
#define EPWM_O_TBPRD        0xC6U  // Time Base Period Register
#define EPWM_O_CMPA         0xD4U  // Counter Compare A Register
#define EPWM_O_CMPB         0xD8U  // Compare B Register
#define EPWM_O_CMPC         0xDEU  // Counter Compare C Register
#define EPWM_O_CMPD         0xE2U  // Counter Compare D Register
#define EPWM_O_GLDCTL2      0xE8U  // Global PWM Load Control Register 2
#define EPWM_O_SWVDELVAL    0xEEU  // Software Valley Mode Delay Register
#define EPWM_O_TZSEL        0x100U // Trip Zone Select Register
#define EPWM_O_TZDCSEL      0x104U // Trip Zone Digital Comparator Select Register
#define EPWM_O_TZCTL        0x108U // Trip Zone Control Register
#define EPWM_O_TZCTL2       0x10AU // Additional Trip Zone Control Register
#define EPWM_O_TZCTLDCA     0x10CU // Trip Zone Control Register Digital Compare A
#define EPWM_O_TZCTLDCB     0x10EU // Trip Zone Control Register Digital Compare B
#define EPWM_O_TZEINT       0x11AU // Trip Zone Enable Interrupt Register
#define EPWM_O_TZFLG        0x126U // Trip Zone Flag Register
#define EPWM_O_TZCBCFLG     0x128U // Trip Zone CBC Flag Register
#define EPWM_O_TZOSTFLG     0x12AU // Trip Zone OST Flag Register
#define EPWM_O_TZCLR        0x12EU // Trip Zone Clear Register
#define EPWM_O_TZCBCCLR     0x130U // Trip Zone CBC Clear Register
#define EPWM_O_TZOSTCLR     0x132U // Trip Zone OST Clear Register
#define EPWM_O_TZFRC        0x136U // Trip Zone Force Register
#define EPWM_O_ETSEL        0x148U // Event Trigger Selection Register
#define EPWM_O_ETPS         0x14CU // Event Trigger Pre-Scale Register
#define EPWM_O_ETFLG        0x150U // Event Trigger Flag Register
#define EPWM_O_ETCLR        0x154U // Event Trigger Clear Register
#define EPWM_O_ETFRC        0x158U // Event Trigger Force Register
#define EPWM_O_ETINTPS      0x15CU // Event-Trigger Interrupt Pre-Scale Register
#define EPWM_O_ETSOCPS      0x160U // Event-Trigger SOC Pre-Scale Register
#define EPWM_O_ETCNTINITCTL 0x164U // Event-Trigger Counter Initialization Control Register
#define EPWM_O_ETCNTINIT    0x168U // Event-Trigger Counter Initialization Register
#define EPWM_O_DCTRIPSEL    0x180U // Digital Compare Trip Select Register
#define EPWM_O_DCACTL       0x186U // Digital Compare A Control Register
#define EPWM_O_DCBCTL       0x188U // Digital Compare B Control Register
#define EPWM_O_DCFCTL       0x18EU // Digital Compare Filter Control Register
#define EPWM_O_DCCAPCTL     0x190U // Digital Compare Capture Control Register
#define EPWM_O_DCFOFFSET    0x192U // Digital Compare Filter Offset Register
#define EPWM_O_DCFOFFSETCNT 0x194U // Digital Compare Filter Offset Counter Register
#define EPWM_O_DCFWINDOW    0x196U // Digital Compare Filter Window Register
#define EPWM_O_DCFWINDOWCNT 0x198U // Digital Compare Filter Window Counter Register
#define EPWM_O_DCCAP        0x19EU // Digital Compare Counter Capture Register
#define EPWM_O_DCAHTRIPSEL  0x1A4U // Digital Compare AH Trip Select
#define EPWM_O_DCALTRIPSEL  0x1A6U // Digital Compare AL Trip Select
#define EPWM_O_DCBHTRIPSEL  0x1A8U // Digital Compare BH Trip Select
#define EPWM_O_DCBLTRIPSEL  0x1AAU // Digital Compare BL Trip Select
#define EPWM_O_LOCK         0x1F4U // EPWM Lock Register
#define EPWM_O_HWVDELVAL    0x1FAU // Hardware Valley Mode Delay Register
#define EPWM_O_VCNTVAL      0x1FCU // Hardware Valley Counter Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the TBCTL register
//
//*************************************************************************************************
#define EPWM_TBCTL_CTRMODE_S   0U
#define EPWM_TBCTL_CTRMODE_M   0x3U // Counter Mode
#define EPWM_TBCTL_PHSEN       0x4U // Phase Load Enable
#define EPWM_TBCTL_PRDLD       0x8U // Active Period Load
#define EPWM_TBCTL_SYNCOSEL_S  4U
#define EPWM_TBCTL_SYNCOSEL_M  0x30U // Sync Output Select
#define EPWM_TBCTL_SWFSYNC     0x40U // Software Force Sync Pulse
#define EPWM_TBCTL_HSPCLKDIV_S 7U
#define EPWM_TBCTL_HSPCLKDIV_M 0x380U // High Speed TBCLK Pre-scaler
#define EPWM_TBCTL_CLKDIV_S    10U
#define EPWM_TBCTL_CLKDIV_M    0x1C00U // Time Base Clock Pre-scaler
#define EPWM_TBCTL_PHSDIR      0x2000U // Phase Direction Bit
#define EPWM_TBCTL_FREE_SOFT_S 14U
#define EPWM_TBCTL_FREE_SOFT_M 0xC000U // Emulation Mode Bits

//*************************************************************************************************
//
// The following are defines for the bit fields in the TBCTL2 register
//
//*************************************************************************************************
#define EPWM_TBCTL2_OSHTSYNCMODE 0x40U // One shot sync mode
#define EPWM_TBCTL2_OSHTSYNC     0x80U // One shot sync
#define EPWM_TBCTL2_SYNCOSELX_S  12U
#define EPWM_TBCTL2_SYNCOSELX_M  0x3000U // Syncout selection
#define EPWM_TBCTL2_PRDLDSYNC_S  14U
#define EPWM_TBCTL2_PRDLDSYNC_M  0xC000U // PRD Shadow to Active Load on SYNC Event

//*************************************************************************************************
//
// The following are defines for the bit fields in the EPWMSYNCINSEL register
//
//*************************************************************************************************
#define EPWM_EPWMSYNCINSEL_SEL_S 0U
#define EPWM_EPWMSYNCINSEL_SEL_M 0x7FU // EPWM SYNCIN Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the TBSTS register
//
//*************************************************************************************************
#define EPWM_TBSTS_CTRDIR 0x1U // Counter Direction Status
#define EPWM_TBSTS_SYNCI  0x2U // External Input Sync Status
#define EPWM_TBSTS_CTRMAX 0x4U // Counter Max Latched Status

//*************************************************************************************************
//
// The following are defines for the bit fields in the CMPCTL register
//
//*************************************************************************************************
#define EPWM_CMPCTL_LOADAMODE_S 0U
#define EPWM_CMPCTL_LOADAMODE_M 0x3U // Active Compare A Load
#define EPWM_CMPCTL_LOADBMODE_S 2U
#define EPWM_CMPCTL_LOADBMODE_M 0xCU   // Active Compare B Load
#define EPWM_CMPCTL_SHDWAMODE   0x10U  // Compare A Register Block Operating Mode
#define EPWM_CMPCTL_SHDWBMODE   0x40U  // Compare B Register Block Operating Mode
#define EPWM_CMPCTL_SHDWAFULL   0x100U // Compare A Shadow Register Full Status
#define EPWM_CMPCTL_SHDWBFULL   0x200U // Compare B Shadow Register Full Status
#define EPWM_CMPCTL_LOADASYNC_S 10U
#define EPWM_CMPCTL_LOADASYNC_M 0xC00U // Active Compare A Load on SYNC
#define EPWM_CMPCTL_LOADBSYNC_S 12U
#define EPWM_CMPCTL_LOADBSYNC_M 0x3000U // Active Compare B Load on SYNC

//*************************************************************************************************
//
// The following are defines for the bit fields in the CMPCTL2 register
//
//*************************************************************************************************
#define EPWM_CMPCTL2_LOADCMODE_S 0U
#define EPWM_CMPCTL2_LOADCMODE_M 0x3U // Active Compare C Load
#define EPWM_CMPCTL2_LOADDMODE_S 2U
#define EPWM_CMPCTL2_LOADDMODE_M 0xCU  // Active Compare D load
#define EPWM_CMPCTL2_SHDWCMODE   0x10U // Compare C Block Operating Mode
#define EPWM_CMPCTL2_SHDWDMODE   0x40U // Compare D Block Operating Mode
#define EPWM_CMPCTL2_LOADCSYNC_S 10U
#define EPWM_CMPCTL2_LOADCSYNC_M 0xC00U // Active Compare C Load on SYNC
#define EPWM_CMPCTL2_LOADDSYNC_S 12U
#define EPWM_CMPCTL2_LOADDSYNC_M 0x3000U // Active Compare D Load on SYNC

//*************************************************************************************************
//
// The following are defines for the bit fields in the DBCTL register
//
//*************************************************************************************************
#define EPWM_DBCTL_OUT_MODE_S    0U
#define EPWM_DBCTL_OUT_MODE_M    0x3U // Dead Band Output Mode Control
#define EPWM_DBCTL_POLSEL_S      2U
#define EPWM_DBCTL_POLSEL_M      0xCU // Polarity Select Control
#define EPWM_DBCTL_IN_MODE_S     4U
#define EPWM_DBCTL_IN_MODE_M     0x30U // Dead Band Input Select Mode Control
#define EPWM_DBCTL_LOADREDMODE_S 6U
#define EPWM_DBCTL_LOADREDMODE_M 0xC0U // Active DBRED Load Mode
#define EPWM_DBCTL_LOADFEDMODE_S 8U
#define EPWM_DBCTL_LOADFEDMODE_M 0x300U // Active DBFED Load Mode
#define EPWM_DBCTL_SHDWDBREDMODE 0x400U // DBRED Block Operating Mode
#define EPWM_DBCTL_SHDWDBFEDMODE 0x800U // DBFED Block Operating Mode
#define EPWM_DBCTL_OUTSWAP_S     12U
#define EPWM_DBCTL_OUTSWAP_M     0x3000U // Dead Band Output Swap Control
#define EPWM_DBCTL_DEDB_MODE     0x4000U // Dead Band Dual-Edge B Mode Control
#define EPWM_DBCTL_HALFCYCLE     0x8000U // Half Cycle Clocking Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the DBCTL2 register
//
//*************************************************************************************************
#define EPWM_DBCTL2_LOADDBCTLMODE_S 0U
#define EPWM_DBCTL2_LOADDBCTLMODE_M 0x3U // DBCTL Load from Shadow Mode Select
#define EPWM_DBCTL2_SHDWDBCTLMODE   0x4U // DBCTL Load mode Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the AQCTL register
//
//*************************************************************************************************
#define EPWM_AQCTL_LDAQAMODE_S 0U
#define EPWM_AQCTL_LDAQAMODE_M 0x3U // Action Qualifier A Load Select
#define EPWM_AQCTL_LDAQBMODE_S 2U
#define EPWM_AQCTL_LDAQBMODE_M 0xCU  // Action Qualifier B Load Select
#define EPWM_AQCTL_SHDWAQAMODE 0x10U // Action Qualifer A Operating Mode
#define EPWM_AQCTL_SHDWAQBMODE 0x40U // Action Qualifier B Operating Mode
#define EPWM_AQCTL_LDAQASYNC_S 8U
#define EPWM_AQCTL_LDAQASYNC_M 0x300U // AQCTLA Register Load on SYNC
#define EPWM_AQCTL_LDAQBSYNC_S 10U
#define EPWM_AQCTL_LDAQBSYNC_M 0xC00U // AQCTLB Register Load on SYNC

//*************************************************************************************************
//
// The following are defines for the bit fields in the AQTSRCSEL register
//
//*************************************************************************************************
#define EPWM_AQTSRCSEL_T1SEL_S 0U
#define EPWM_AQTSRCSEL_T1SEL_M 0xFU // T1 Event Source Select Bits
#define EPWM_AQTSRCSEL_T2SEL_S 4U
#define EPWM_AQTSRCSEL_T2SEL_M 0xF0U // T2 Event Source Select Bits

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCCTL register
//
//*************************************************************************************************
#define EPWM_PCCTL_CHPEN     0x1U // PWM chopping enable
#define EPWM_PCCTL_OSHTWTH_S 1U
#define EPWM_PCCTL_OSHTWTH_M 0x1EU // One-shot pulse width
#define EPWM_PCCTL_CHPFREQ_S 5U
#define EPWM_PCCTL_CHPFREQ_M 0xE0U // Chopping clock frequency
#define EPWM_PCCTL_CHPDUTY_S 8U
#define EPWM_PCCTL_CHPDUTY_M 0x700U // Chopping clock Duty cycle

//*************************************************************************************************
//
// The following are defines for the bit fields in the VCAPCTL register
//
//*************************************************************************************************
#define EPWM_VCAPCTL_VCAPE          0x1U // Valley  Capture mode
#define EPWM_VCAPCTL_VCAPSTART      0x2U // Valley  Capture Start
#define EPWM_VCAPCTL_TRIGSEL_S      2U
#define EPWM_VCAPCTL_TRIGSEL_M      0x1CU // Capture Trigger Select
#define EPWM_VCAPCTL_VDELAYDIV_S    7U
#define EPWM_VCAPCTL_VDELAYDIV_M    0x380U // Valley Delay Mode Divide Enable
#define EPWM_VCAPCTL_EDGEFILTDLYSEL 0x400U // Valley Switching Mode Delay Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the VCNTCFG register
//
//*************************************************************************************************
#define EPWM_VCNTCFG_STARTEDGE_S  0U
#define EPWM_VCNTCFG_STARTEDGE_M  0xFU  // Counter Start Edge Selection
#define EPWM_VCNTCFG_STARTEDGESTS 0x80U // Start Edge Status Bit
#define EPWM_VCNTCFG_STOPEDGE_S   8U
#define EPWM_VCNTCFG_STOPEDGE_M   0xF00U  // Counter Start Edge Selection
#define EPWM_VCNTCFG_STOPEDGESTS  0x8000U // Stop Edge Status Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the HRCNFG register
//
//*************************************************************************************************
#define EPWM_HRCNFG_EDGMODE_S  0U
#define EPWM_HRCNFG_EDGMODE_M  0x3U // ePWMxA Edge Mode Select Bits
#define EPWM_HRCNFG_CTLMODE    0x4U // ePWMxA Control Mode Select Bits
#define EPWM_HRCNFG_HRLOAD_S   3U
#define EPWM_HRCNFG_HRLOAD_M   0x18U // ePWMxA Shadow Mode Select Bits
#define EPWM_HRCNFG_SELOUTB    0x20U // EPWMB Output Selection Bit
#define EPWM_HRCNFG_AUTOCONV   0x40U // Autoconversion Bit
#define EPWM_HRCNFG_SWAPAB     0x80U // Swap EPWMA and EPWMB Outputs Bit
#define EPWM_HRCNFG_EDGMODEB_S 8U
#define EPWM_HRCNFG_EDGMODEB_M 0x300U // ePWMxB Edge Mode Select Bits
#define EPWM_HRCNFG_CTLMODEB   0x400U // ePWMxB Control Mode Select Bits
#define EPWM_HRCNFG_HRLOADB_S  11U
#define EPWM_HRCNFG_HRLOADB_M  0x1800U // ePWMxB Shadow Mode Select Bits

//*************************************************************************************************
//
// The following are defines for the bit fields in the HRPWR register
//
//*************************************************************************************************
#define EPWM_HRPWR_CALPWRON 0x8000U // Calibration Power On

//*************************************************************************************************
//
// The following are defines for the bit fields in the HRMSTEP register
//
//*************************************************************************************************
#define EPWM_HRMSTEP_HRMSTEP_S 0U
#define EPWM_HRMSTEP_HRMSTEP_M 0xFFU // High Resolution Micro Step Value

//*************************************************************************************************
//
// The following are defines for the bit fields in the HRCNFG2 register
//
//*************************************************************************************************
#define EPWM_HRCNFG2_EDGMODEDB_S    0U
#define EPWM_HRCNFG2_EDGMODEDB_M    0x3U // Dead-Band Edge-Mode Select Bits
#define EPWM_HRCNFG2_CTLMODEDBRED_S 2U
#define EPWM_HRCNFG2_CTLMODEDBRED_M 0xCU // DBRED Control Mode Select Bits
#define EPWM_HRCNFG2_CTLMODEDBFED_S 4U
#define EPWM_HRCNFG2_CTLMODEDBFED_M 0x30U // DBFED Control Mode Select Bits

//*************************************************************************************************
//
// The following are defines for the bit fields in the HRPCTL register
//
//*************************************************************************************************
#define EPWM_HRPCTL_HRPE          0x1U // High Resolution Period Enable
#define EPWM_HRPCTL_PWMSYNCSEL    0x2U // EPWMSYNCPER Source Select
#define EPWM_HRPCTL_TBPHSHRLOADE  0x4U // TBPHSHR Load Enable
#define EPWM_HRPCTL_PWMSYNCSELX_S 4U
#define EPWM_HRPCTL_PWMSYNCSELX_M 0x70U // EPWMSYNCPER Extended Source Select Bit:

//*************************************************************************************************
//
// The following are defines for the bit fields in the TRREM register
//
//*************************************************************************************************
#define EPWM_TRREM_TRREM_S 0U
#define EPWM_TRREM_TRREM_M 0x7FFU // HRPWM Remainder Bits

//*************************************************************************************************
//
// The following are defines for the bit fields in the GLDCTL register
//
//*************************************************************************************************
#define EPWM_GLDCTL_GLD       0x1U // Global Shadow to Active load event control
#define EPWM_GLDCTL_GLDMODE_S 1U
#define EPWM_GLDCTL_GLDMODE_M 0x1EU // Shadow to Active Global Load Pulse Selection
#define EPWM_GLDCTL_OSHTMODE  0x20U // One Shot Load mode control bit
#define EPWM_GLDCTL_GLDPRD_S  7U
#define EPWM_GLDCTL_GLDPRD_M  0x380U // Global Load Strobe Period Select Register
#define EPWM_GLDCTL_GLDCNT_S  10U
#define EPWM_GLDCTL_GLDCNT_M  0x1C00U // Global Load Strobe Counter Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the GLDCFG register
//
//*************************************************************************************************
#define EPWM_GLDCFG_TBPRD_TBPRDHR  0x1U   // Global load event configuration for TBPRD:TBPRDHR
#define EPWM_GLDCFG_CMPA_CMPAHR    0x2U   // Global load event configuration for CMPA:CMPAHR
#define EPWM_GLDCFG_CMPB_CMPBHR    0x4U   // Global load event configuration for CMPB:CMPBHR
#define EPWM_GLDCFG_CMPC           0x8U   // Global load event configuration for CMPC
#define EPWM_GLDCFG_CMPD           0x10U  // Global load event configuration for CMPD
#define EPWM_GLDCFG_DBRED_DBREDHR  0x20U  // Global load event configuration for DBRED:DBREDHR
#define EPWM_GLDCFG_DBFED_DBFEDHR  0x40U  // Global load event configuration for DBFED:DBFEDHR
#define EPWM_GLDCFG_DBCTL          0x80U  // Global load event configuration for DBCTL
#define EPWM_GLDCFG_AQCTLA_AQCTLA2 0x100U // Global load event configuration for AQCTLA/A2
#define EPWM_GLDCFG_AQCTLB_AQCTLB2 0x200U // Global load event configuration for AQCTLB/B2
#define EPWM_GLDCFG_AQCSFRC        0x400U // Global load event configuration for AQCSFRC

//*************************************************************************************************
//
// The following are defines for the bit fields in the EPWMXLINK register
//
//*************************************************************************************************
#define EPWM_XLINK_TBPRDLINK_S   0U
#define EPWM_XLINK_TBPRDLINK_M   0xFU // TBPRD:TBPRDHR  Link
#define EPWM_XLINK_CMPALINK_S    4U
#define EPWM_XLINK_CMPALINK_M    0xF0U // CMPA:CMPAHR Link
#define EPWM_XLINK_CMPBLINK_S    8U
#define EPWM_XLINK_CMPBLINK_M    0xF00U // CMPB:CMPBHR Link
#define EPWM_XLINK_CMPCLINK_S    12U
#define EPWM_XLINK_CMPCLINK_M    0xF000U // CMPC Link
#define EPWM_XLINK_CMPDLINK_S    16U
#define EPWM_XLINK_CMPDLINK_M    0xF0000U // CMPD Link
#define EPWM_XLINK_GLDCTL2LINK_S 28U
#define EPWM_XLINK_GLDCTL2LINK_M 0xF0000000U // GLDCTL2 Link

//*************************************************************************************************
//
// The following are defines for the bit fields in the AQCTLA register
//
//*************************************************************************************************
#define EPWM_AQCTLA_ZRO_S 0U
#define EPWM_AQCTLA_ZRO_M 0x3U // Action Counter = Zero
#define EPWM_AQCTLA_PRD_S 2U
#define EPWM_AQCTLA_PRD_M 0xCU // Action Counter = Period
#define EPWM_AQCTLA_CAU_S 4U
#define EPWM_AQCTLA_CAU_M 0x30U // Action Counter = Compare A Up
#define EPWM_AQCTLA_CAD_S 6U
#define EPWM_AQCTLA_CAD_M 0xC0U // Action Counter = Compare A Down
#define EPWM_AQCTLA_CBU_S 8U
#define EPWM_AQCTLA_CBU_M 0x300U // Action Counter = Compare B Up
#define EPWM_AQCTLA_CBD_S 10U
#define EPWM_AQCTLA_CBD_M 0xC00U // Action Counter = Compare B Down

//*************************************************************************************************
//
// The following are defines for the bit fields in the AQCTLA2 register
//
//*************************************************************************************************
#define EPWM_AQCTLA2_T1U_S 0U
#define EPWM_AQCTLA2_T1U_M 0x3U // Action when event occurs on T1 in UP-Count
#define EPWM_AQCTLA2_T1D_S 2U
#define EPWM_AQCTLA2_T1D_M 0xCU // Action when event occurs on T1 in DOWN-Count
#define EPWM_AQCTLA2_T2U_S 4U
#define EPWM_AQCTLA2_T2U_M 0x30U // Action when event occurs on T2 in UP-Count
#define EPWM_AQCTLA2_T2D_S 6U
#define EPWM_AQCTLA2_T2D_M 0xC0U // Action when event occurs on T2 in DOWN-Count

